{"id": 1, "generator_model": "gpt-4o-mini", "original": "Hi, just checking in on the meeting notes.", "edited": "Subject: Follow-Up on Meeting Notes\n\nHi [Recipient's Name],\n\nI hope this message finds you well. I wanted to follow up regarding the meeting notes from our recent discussion. \n\nCould you please provide an update on their status? I appreciate your assistance and look forward to your response.\n\nThank you!\n\nBest regards,  \n[Your Name]  \n[Your Position]  \n[Your Contact Information]"}
{"id": 2, "generator_model": "gpt-4o-mini", "original": "Hey team, we really need those deliverables by Friday or we’ll miss the client handoff. Let’s stay sharp.", "edited": "Subject: Urgent: Deliverables Needed by Friday\n\nHi Team,\n\nI hope this message finds you well. I want to emphasize the importance of our upcoming deadline. We need to ensure that all deliverables are completed and submitted by this Friday. If we do not meet this timeline, we risk missing the client handoff, which could have significant implications for our project.\n\nLet’s stay focused and sharp as we work towards this goal. Your efforts are greatly appreciated, and I am confident that we can meet this deadline together.\n\nThank you for your attention to this matter.\n\nBest regards,  \n[Your Name]"}
{"id": 3, "generator_model": "gpt-4o-mini", "original": "Dear Professor, I’ve attached my revised thesis draft. Could you please share any feedback before next Tuesday?", "edited": "Subject: Request for Feedback on Revised Thesis Draft\n\nDear Professor,\n\nI hope this message finds you well. \n\nI have attached my revised thesis draft for your review. I would greatly appreciate it if you could share any feedback you may have. Your insights are invaluable to me as I work towards finalizing my thesis.\n\nIf possible, I would kindly request your feedback before next Tuesday, as this would allow me ample time to make any necessary adjustments.\n\nThank you very much for your assistance. I look forward to hearing from you soon.\n\nBest regards,  \n[Your Name]  \n[Your Contact Information]"}
{"id": 4, "generator_model": "gpt-4o-mini", "original": "Yo! You still up for that hike Saturday morning? Weather looks good!", "edited": "Subject: Saturday Morning Hike\n\nHi there!\n\nI hope this message finds you well. I wanted to check in and see if you are still interested in going for that hike on Saturday morning. The weather forecast looks promising, which should make for a great day outdoors.\n\nPlease let me know if you’re still on board!\n\nLooking forward to hearing from you.\n\nBest,  \n[Your Name]"}
{"id": 5, "generator_model": "gpt-4o-mini", "original": "Congratulations on your offer! Attached is your official offer letter and onboarding details.", "edited": "Subject: Congratulations on Your Offer!\n\nDear [Recipient's Name],\n\nI hope this message finds you well. \n\nI am thrilled to extend my heartfelt congratulations on your offer! This is an exciting opportunity, and we are delighted to welcome you to our team.\n\nAttached to this email, you will find your official offer letter along with important onboarding details. Please take the time to review these documents carefully, as they contain essential information regarding your start date, benefits, and other pertinent details.\n\nIf you have any questions or need further clarification, do not hesitate to reach out. We are here to assist you as you prepare for this new chapter.\n\nOnce again, congratulations! We look forward to having you on board.\n\nBest regards,\n\n[Your Name]  \n[Your Position]  \n[Your Company]  \n[Your Contact Information]"}
