{"id": 1, "generator_model": "gpt-4.1", "original": "Hi, just checking in on the meeting notes.", "edited": "Hi,\n\nI wanted to follow up regarding the meeting notes. Could you please let me know if they are available, or if there is an estimated time when they will be shared?\n\nThank you for your help.\n\nBest regards,"}
{"id": 2, "generator_model": "gpt-4.1", "original": "Hey team, we really need those deliverables by Friday or we’ll miss the client handoff. Let’s stay sharp.", "edited": "Hi team,\n\nI wanted to remind everyone that we need to have all deliverables completed by Friday. Meeting this deadline is crucial, as any delays will impact our ability to hand off the project to the client on time.\n\nLet’s stay focused and make sure everything is on track. Please let me know if you encounter any issues or need support as we work toward this deadline.\n\nThank you for your hard work and dedication."}
{"id": 3, "generator_model": "gpt-4.1", "original": "Dear Professor, I’ve attached my revised thesis draft. Could you please share any feedback before next Tuesday?", "edited": "Dear Professor,\n\nI hope this message finds you well. I have attached the revised draft of my thesis for your review.\n\nI would greatly appreciate it if you could share any feedback or suggestions you may have before next Tuesday. Your insights are very valuable to me as I work to improve my thesis.\n\nThank you very much for your time and support.\n\nBest regards,  \n[Your Name]"}
{"id": 4, "generator_model": "gpt-4.1", "original": "Yo! You still up for that hike Saturday morning? Weather looks good!", "edited": "Hi!\n\nJust checking in to see if you’re still up for our hike on Saturday morning. The weather forecast looks great, so it should be a perfect day to get outside.\n\nLet me know if you’re still interested or if anything has changed. Looking forward to it!\n\nThanks!"}
{"id": 5, "generator_model": "gpt-4.1", "original": "Congratulations on your offer! Attached is your official offer letter and onboarding details.", "edited": "Congratulations on receiving your offer!\n\nWe are pleased to inform you that your official offer letter and onboarding details are attached to this email. Please review the documents carefully at your earliest convenience.\n\nIf you have any questions or need further clarification regarding the offer or the onboarding process, feel free to reach out. We are here to assist you and look forward to welcoming you to the team.\n\nOnce again, congratulations!\n\nBest regards,"}
