{"id": 1, "sender": "alice@example.com", "subject": "Meeting Follow-Up", "content": "Hi, just checking in on the meeting notes."}
{"id": 2, "sender": "mark.jones@startup.io", "subject": "Project Deadline Concern", "content": "Hey team, we really need those deliverables by Friday or we’ll miss the client handoff. Let’s stay sharp."}
{"id": 3, "sender": "susan.lee@university.edu", "subject": "Thesis Feedback", "content": "Dear Professor, I’ve attached my revised thesis draft. Could you please share any feedback before next Tuesday?"}
{"id": 4, "sender": "daniel@personalmail.com", "subject": "Weekend Hike", "content": "Yo! You still up for that hike Saturday morning? Weather looks good!"}
{"id": 5, "sender": "hr@finwellcorp.com", "subject": "Offer Letter Update", "content": "Congratulations on your offer! Attached is your official offer letter and onboarding details."}
{"id": 6, "sender": "carol@creativeagency.org", "subject": "Design Revisions", "content": "Hi team, please review the attached mockups and add comments by end of day tomorrow."}
{"id": 7, "sender": "mike89@gmail.com", "subject": "Rant About Deadlines", "content": "I’m honestly so done with these shifting deadlines. How are we supposed to plan anything properly?"}
{"id": 8, "sender": "tina@bookclub.com", "subject": "Book of the Month", "content": "Hey readers! This month we’re diving into 'The Night Circus.' Meeting is next Thursday evening!"}
{"id": 9, "sender": "andre@techsolutions.ai", "subject": "Client Demo Prep", "content": "Morning all, let’s finalize the demo scripts by noon. I’ll run through the slide deck after lunch."}
{"id": 10, "sender": "nina@wellnesscenter.org", "subject": "Appointment Reminder", "content": "Hi, this is a reminder for your appointment with Dr. Patel on Wednesday at 10:30 AM."}
{"id": 11, "sender": "jessica@friendsmail.com", "subject": "Rough Day", "content": "Ugh, today was such a mess. Traffic, deadlines, and my coffee spilled twice. I just need a nap."}
{"id": 12, "sender": "info@nonprofitaction.org", "subject": "Thank You for Donating!", "content": "We’re so grateful for your support. Your contribution helps us provide food and shelter to families in need."}
{"id": 13, "sender": "peter@company.com", "subject": "Budget Review", "content": "Team, please review the Q3 financial summary and identify areas where we can cut costs."}
{"id": 14, "sender": "emily@artschool.edu", "subject": "Portfolio Critique", "content": "Hi! Could you take a look at my updated digital portfolio? I’m hoping to apply for the spring showcase."}
{"id": 15, "sender": "support@travelbuddy.com", "subject": "Flight Cancellation Notice", "content": "Your flight TB473 to Paris has been canceled due to weather. Please visit our site to rebook or request a refund."}
{"id": 16, "sender": "lucas@devmail.net", "subject": "Code Review", "content": "Hey, I pushed the latest branch. Can you check for bugs in the data parser module?"}
{"id": 17, "sender": "aisha@greengrow.co", "subject": "Marketing Campaign Results", "content": "Hi team, the campaign exceeded expectations! Engagement rose 25% and conversions 12%. Great work!"}
{"id": 18, "sender": "dad@example.com", "subject": "Proud of You", "content": "Hey kiddo, just wanted to say I’m proud of how hard you’re working lately. Keep it up."}
{"id": 19, "sender": "rose@fashionhub.com", "subject": "Partnership Proposal", "content": "Hello, we’re interested in collaborating on a social media campaign for our new collection. Let’s discuss details soon."}
{"id": 20, "sender": "ben@languagelab.ai", "subject": "Research Update", "content": "Hi, I’ve uploaded the latest experiment logs. The model shows promising accuracy improvements."}
{"id": 21, "sender": "grace@bakeshop.net", "subject": "Catering Request", "content": "Hello, I’d like to order cupcakes and pastries for a 30-person event on November 10th."}
{"id": 22, "sender": "samuel@corporate.com", "subject": "Performance Review Scheduling", "content": "Hi Alex, let’s schedule your annual performance review next week. Please send me your availability."}
{"id": 23, "sender": "rachel@neighbors.org", "subject": "Lost Dog Alert", "content": "Hi all, a golden retriever was found near Maple Street Park. Contact us if you think it’s yours."}
{"id": 24, "sender": "dev@openaiapps.dev", "subject": "API Key Usage", "content": "Reminder: You’ve reached 80% of your monthly API limit. Upgrade or reduce usage to avoid service disruption."}
{"id": 25, "sender": "alex@musiclovers.fm", "subject": "Concert Plans", "content": "Hey! Got tickets to the indie festival next month — want to come?"}
{"id": 26, "sender": "chris@consultancy.biz", "subject": "Proposal Feedback", "content": "Dear team, after reviewing the proposal, I recommend expanding the section on competitive differentiation."}
{"id": 27, "sender": "support@shopifyplus.com", "subject": "Subscription Renewal", "content": "Your annual plan renews on November 15. No action needed unless you wish to cancel or modify your plan."}
{"id": 28, "sender": "sofia@personalmail.com", "subject": "Catching Up", "content": "It’s been forever since we last talked! How have you been? Let’s grab lunch soon."}
{"id": 29, "sender": "leo@technewsdaily.com", "subject": "Interview Request", "content": "Hi, we’d love to feature you in our upcoming article about AI startups. Would you be open to a short interview?"}
{"id": 30, "sender": "ryan@freelancer.org", "subject": "Invoice for October", "content": "Please find attached the invoice for October deliverables. Payment due within 14 days."}
{"id": 31, "sender": "no-reply@cityalerts.gov", "subject": "Severe Weather Warning", "content": "Alert: Heavy rain and flooding expected in your area tonight. Stay indoors if possible."}
{"id": 32, "sender": "olivia@wellnesshub.com", "subject": "Mindfulness Session Recap", "content": "Hi everyone, thank you for joining today’s mindfulness session. Attached are the guided exercises and reflection notes."}
{"id": 33, "sender": "derek@teamx.io", "subject": "Frustration with Communication", "content": "Honestly, it’s getting hard to keep track when everyone uses different tools. Can we please consolidate channels?"}
{"id": 34, "sender": "mom@example.com", "subject": "Dinner Plans", "content": "Hi sweetie, are you coming for dinner Sunday night? I’m making your favorite lasagna."}
{"id": 35, "sender": "zoe@startuphub.org", "subject": "Pitch Deck Review", "content": "Hey, could you take a quick look at my pitch deck? Need some honest feedback before demo day."}
{"id": 36, "sender": "library@city.edu", "subject": "Overdue Notice", "content": "Your borrowed book 'Modern Linguistics' is overdue. Please return it or renew within 3 days."}
{"id": 37, "sender": "felix@remoteworkers.co", "subject": "Team Check-In", "content": "Good morning team, just wanted to do a quick async check-in. How’s everyone progressing this week?"}
{"id": 38, "sender": "hannah@wellbeing.org", "subject": "Burnout Awareness Workshop", "content": "Join our free webinar next Tuesday to learn about managing stress and building resilience at work."}
{"id": 39, "sender": "claire@company.com", "subject": "Urgent: Client Escalation", "content": "We received an escalation from the client about missing documentation. Please resolve by end of day."}
{"id": 40, "sender": "ian@outdoorclub.net", "subject": "Trip Recap", "content": "That weekend trip was amazing! I still can’t believe we hiked 20 miles in two days. Photos attached!"}
{"id": 41, "sender": "dana@brandco.com", "subject": "Product Launch Prep", "content": "Hi all, let’s finalize the marketing copy and visuals today so we can go live tomorrow morning."}
{"id": 42, "sender": "victor@financecorp.com", "subject": "Expense Report Missing", "content": "Please submit your October expense report by Friday or your reimbursement will be delayed."}
{"id": 43, "sender": "kate@communitycenter.org", "subject": "Volunteer Appreciation", "content": "Thank you all for your time and effort this month. You truly make a difference in our community!"}
{"id": 44, "sender": "noah@fitnesslab.co", "subject": "Workout Summary", "content": "Your weekly stats are in: 4 workouts, 1,800 calories burned, and consistent improvement in endurance!"}
{"id": 45, "sender": "customer@reviewhub.com", "subject": "Complaint About Service", "content": "I’m disappointed with how my support ticket was handled. It’s been a week and no one has responded."}
{"id": 46, "sender": "ella@studioart.net", "subject": "Gallery Invitation", "content": "We’re thrilled to invite you to our winter gallery opening on December 5. RSVP by November 20."}
{"id": 47, "sender": "leo@friendsmail.com", "subject": "Just Checking In", "content": "Hey man, haven’t heard from you in a while. Everything okay?"}
{"id": 48, "sender": "recruiting@techhire.ai", "subject": "Interview Schedule Confirmation", "content": "Your interview for the ML Engineer position is confirmed for Thursday, November 7 at 2:00 PM PST."}
{"id": 49, "sender": "maria@culinaryclub.org", "subject": "Recipe Swap", "content": "Hey everyone! Share your favorite comfort food recipes this week — I’ll post mine tomorrow!"}
{"id": 50, "sender": "ethan@projectx.com", "subject": "End of Quarter Wrap-Up", "content": "We’ve officially wrapped up Q4! Please send your retrospectives and lessons learned by Monday."}
{"id": 51, "sender": "sam.b@companyintern.com", "subject": "missed deadline", "content": "- missed deadline\n- not sure what to do\n- sorry"}
{"id": 52, "sender": "mike.r23@gmail.com", "subject": "Refund please", "content": "hi, still waiting for my refund. it’s been almost 2 weeks now and nobody has bothered to get back to me. not sure what’s taking so long. i sent all the info you asked for already. would appreciate if someone could finally process this instead of ignoring my emails. thanks."}
{"id": 53, "sender": "jonah.intern@company.com", "subject": "following up", "content": "hi, just checking in on my last email"}
{"id": 54, "sender": "gabe.intern@techsphere.com", "subject": "server crash sorry", "content": "hey, uh, server went down after my patch. tried rollback, still not up. logs just spam errors. i might’ve messed something big, really sorry. not sure who to ask or what to do now. if anyone knows fix pls help? i’ll stay online for updates. sry again for trouble, super nervous here."}
{"id": 55, "sender": "jane@acmeleadership.com", "subject": "thanks for your help", "content": "hi team,\n\njust wanted to send a quick thank you for all the work on the merger stuff. i know i haven’t really been available much lately (sorry about that, been swamped), but I do see the extra hours and dedication everyone’s putting in. i realize I haven’t acknowledged that enough, so thank you again for pulling together. really appreciate everyone stepping up where needed, even with all the changes and last minute stuff.\n\nif i’ve missed anything important or you need more from me, pls let me know. will try to be more present next week. thanks again and sorry for being hard to reach.\n\n-jane"}
{"id": 56, "sender": "jamie.c@devteam.org", "subject": "server kaboom!", "content": "yo! prod went full kaboom 3am lol. logs = gibberish. tried patch, nada. can u peek? thinking bad mem leak? cheers if u can save it :D"}
{"id": 57, "sender": "ceo.liu@fastcorp.com", "subject": "sync time?", "content": "hi, we need sync this week. my calendar full, maybe wed or thu? pls check your time. keep short, just main update. let me know quick. thx."}
{"id": 58, "sender": "annoyedguy23@gmail.com", "subject": "your server crashed", "content": "fix your server now. totally unacceptable."}
{"id": 59, "sender": "daniel.codes@gmail.com", "subject": "refund req", "content": "Hi, want refund asap. Paid for annual plan by mistake, not using it. Cancel and refund pls. Already contacted support, no reply yet. Need this fixed."}
{"id": 60, "sender": "jake.sells@bizflow.com", "subject": "oops deadline!", "content": "ran late! will fix soon. thx all!!"}
{"sender": "unknown@placeholder.com", "subject": "Data Error Placeholder", "content": "This row was originally null in the source dataset.", "id": 61}
{"id": 62, "sender": "sarah.mom3@gmail.com", "subject": "sorry for late reply", "content": "so sorry, things got busy. still interested!"}
{"id": 63, "sender": "ceo.julie@companyhub.com", "subject": "server crashed?", "content": "what happened to the server? anyone looking into this?"}
{"id": 64, "sender": "julia.r@internmail.com", "subject": "feedback?", "content": "Hey,\n\nSo I’m honestly not really sure what you want me to do here. Got some feedback from yesterday, but like, it was pretty vague and I don’t get what’s actually wrong? If I’m supposed to fix something, I need specifics, otherwise I just waste time guessing. Did anyone actually read my last report or is everyone just sending random comments, cause it feels that way. Sorry but I’m just kinda lost at this point. If you want me to do something better, can someone just say what exactly needs fixing, instead of weird general feedback?\n\nThanks, I guess."}
{"id": 65, "sender": "mom.jane83@gmail.com", "subject": "sync time", "content": "we need to sync soon. pick time pls."}
{"id": 66, "sender": "jess.holt@fastsales.com", "subject": "refund?", "content": "Hi, could I maybe get a refund? Thanks."}
{"id": 67, "sender": "hr.admin@corpco.com", "subject": "sync needed", "content": "need to set up a sync with you. pick a time and let me know, don’t make me chase you. let’s get this done fast, thanks."}
{"id": 68, "sender": "hr.jane@corpcorp.com", "subject": "Offer withdrawal", "content": "- withdrawing offer\n- urgent reasons\n- contact if needed"}
{"id": 69, "sender": "jane.mom@gmail.com", "subject": "about the app", "content": "not sure it works? kids can’t log in"}
{"id": 70, "sender": "lisa.mom3@gmail.com", "subject": "server crashed again", "content": "server crashed. of course it did. can someone fix it this time or are we just pretending it’s fine? I’ve got better things to do than babysit this mess."}
{"id": 71, "sender": "jen.events@plannerpro.com", "subject": "sync timing?", "content": "- not sure when sync is\n- who’s joining?\n- pls clarify"}
{"id": 72, "sender": "jordan.smith@sellwise.com", "subject": "checking in", "content": "hey just circling back on last msg. haven’t heard, guessing busy? lmk if still interested or something changed. can set up quick call if easier. thx"}
{"id": 73, "sender": "jules.mom@gmail.com", "subject": "server probs", "content": "server crashed again. not sure why. too much on my plate rn, can’t dig in. can someone look? kids sick, no sleep, sry for delay. thx."}
{"id": 74, "sender": "jake.intern@marketco.com", "subject": "Missed deadline update", "content": "- missed deadline on report (sorry)\n- had trouble w/ data export, system kept crashing\n- tried reaching out to IT but no response\n- ended up wasting a lot of time, v frustrating\n- not sure what to do now (should I just send the incomplete one?)\n- didn’t want this to happen, feeling kinda annoyed tbh\n- deadline was unclear in the first place, got mixed messages\n- pls let me know what I should do next\n- can fix asap if I get some direction, just let me know"}
{"id": 75, "sender": "jess.carter@email.com", "subject": "feedback", "content": "so, i’m not happy with my last order. was late and stuff missing. not sure if i want to order again honestly. don’t wanna make a fuss but kinda disappointed."}
{"sender": "unknown@placeholder.com", "subject": "Data Error Placeholder", "content": "This row was originally null in the source dataset.", "id": 76}
{"id": 77, "sender": "tara.wu@nextgenventures.com", "subject": "Refund?", "content": "Still no refund. Told “soon” last week. Team asking why $$$ missing. Pls explain delay. Not impressed. Shouldn’t be chasing you for this. Fix it or let me know what’s up."}
{"id": 78, "sender": "mom.sarah22@mail.com", "subject": "refund?", "content": "why is my refund not here yet? fix this."}
{"id": 79, "sender": "jane.events@planitco.com", "subject": "deadline?", "content": "deadline gone? missed? what now? lost here."}
{"id": 80, "sender": "jason.l@companyinterns.com", "subject": "invoice prob?", "content": "uh so invoice 1432 weird again. numbers off? not sure why, followed last week’s steps. not sure if I should even ask at this point lol. maybe it’s just me missing something? but seems same as last time tbh. someone wanna take a look or... idk, up to you guys. thx I guess."}
{"id": 81, "sender": "hrdept@firmco.com", "subject": "sync asap", "content": "need sync tmrw morning. confirm now."}
{"id": 82, "sender": "alex.ceo@ventureplus.com", "subject": "Still waiting", "content": "Why haven’t you replied? Need update. Now."}
{"id": 83, "sender": "jake.intern@campusmail.edu", "subject": "about offer", "content": "- thank you\n- not sure I can accept\n- sorry"}
{"sender": "unknown@placeholder.com", "subject": "Data Error Placeholder", "content": "This row was originally null in the source dataset.", "id": 84}
{"id": 85, "sender": "lisa@eventsbylisa.com", "subject": "refund question", "content": "client wants refund, what’s process? let me know."}
{"id": 86, "sender": "jane.smith@clientmail.com", "subject": "Sick Leave Issue", "content": "- submitted sick leave form\n- not approved yet\n- need response ASAP\n- not acceptable to wait this long\n- please fix this today"}
{"id": 87, "sender": "joshua.tang@devsquad.com", "subject": "urgent: server crash update", "content": "hey team,\n\nheads up, production server crashed about 10 mins ago. seeing 500s on all endpoints, dashboard not loading. checked error logs but nothing obvious yet. restarted services but no luck, still down. not sure if it’s related to latest merge but happened soon after. \n\nwill keep digging into logs and system metrics. let me know if anyone else can jump on this. sorry for the downtime, trying to resolve asap. \n\nping me if you need more info or want to pair on debugging. will update when I have something new."}
{"id": 88, "sender": "hrteam@prodigyhr.com", "subject": "Invoice problem", "content": "Hi,\n\nNoticed an error on the latest invoice – the amount billed for training sessions doesn’t match the approved rates. Please check line items, esp. section 3, and clarify why the discrepancy happened. Need a corrected version asap for processing. Also, missing employee IDs for some attendees, which is required per our policy. Please make sure future invoices have the proper breakdown with names and IDs, as mentioned before. Let me know if you need the reference sheet again. This needs to be sorted before payroll closes next week or it’ll delay payment. Thx.\n\n- HR"}
{"id": 89, "sender": "j.smith@familymail.com", "subject": "Out Sick", "content": "Kid sick. Not coming in. Will update later."}
{"id": 90, "sender": "hr.strict@companymail.com", "subject": "server crash", "content": "Not acceptable. Who responsible? Need fix now."}
{"id": 91, "sender": "hr-strict@companymail.com", "subject": "follow up", "content": "sorry for delay, missed your last email. any updates?"}
{"id": 92, "sender": "sara.d@companyhq.com", "subject": "server down again", "content": "server crashed again. not happy. clients pinging me nonstop. why does this keep happening? need fixes, not excuses. let me know what's actually being done about this."}
{"id": 93, "sender": "linh.nguyen1@companyinterns.com", "subject": "Thank you for help", "content": "Hi, I just want say thank you so much for help me today. I am very sorry if I ask too many question or make you busy. I am still learn lot of thing and sometime I do mistake. Please forgive if I confuse too much. I really want to do good job here and you always very patient and explain for me. I am worry sometimes you think I am not smart enough, but I try my best. So thank you again for everything, I appreciate a lot. If I do something wrong please tell me, I will fix."}
{"id": 94, "sender": "jessica.hart@eventscope.com", "subject": "Server crash during event setup", "content": "- server crashed at around 10:15am while uploading guest lists\n- couldn’t access dashboard for ~30 min, kept timing out\n- tried a few refreshes, cleared cache, didn’t solve\n- some vendors asking for updated schedules, couldn’t send files\n- not sure if anyone else is affected but worried about tonight’s rehearsal\n- can you check what’s going on? urgent since clients expecting updates\n- don’t know if I need to redo uploads or if data’s lost\n- pls let me know asap, need to plan backup if this happens again\n- sorry for short notice, everything’s a mess right now"}
{"id": 95, "sender": "jess.events@email.com", "subject": "server crashed!", "content": "hey team! quick heads up, server crashed just now. working on it but might delay event reg. let me know if you have backup plan. thx!!"}
{"id": 96, "sender": "hrdept@mbgcorp.com", "subject": "Refund Request", "content": "asking again about the refund. haven’t seen anything come through yet. this is taking way too long. can someone deal with this soon? really need an update."}
{"id": 97, "sender": "jane.mom@familynet.com", "subject": "Feedback", "content": "ok so I need to give feedback about the last PTA meeting and honestly, it was way too long and not helpful. nobody listens, everyone talks over each other. why do we keep having these? feels like a waste of time. also, the snacks were stale again, so maybe pay attention to that next time? not sure anyone cares what parents actually think, we just get told what will happen. tired of coming all the way for nothing. if you actually want people to show up, maybe fix some of these things. don't want another pointless meeting, thanks."}
{"id": 98, "sender": "ceo.james@fasttechglobal.com", "subject": "refund now", "content": "I’m writing because I’m seriously annoyed. We paid for your service, and it’s barely worked for us. Don’t see the point of continuing, it’s not what you promised at all. I want a refund, and I want it fast. No excuses, no runaround, just process it immediately. We already wasted enough time and money dealing with this. If you need info, go find it in your system because I’m not sending you a bunch of stuff again. This is urgent, I don’t want to have to follow up more than once. Handle this."}
{"id": 99, "sender": "sarah.mom3@gmail.com", "subject": "refund please", "content": "- wrong item\n- sorry\n- need refund"}
{"id": 100, "sender": "jenna@eventsbyjen.com", "subject": "sync schedule", "content": "- need to set up sync\n- ppl: me, you, Alex\n- what days work?\n- prefer morning if possible\n- zoom ok?\nlet me know"}
